# Combining scrapped data into one dataframe

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Import-all-the-relevant-csv-files-as-dataframes-using-pandas" data-toc-modified-id="Import-all-the-relevant-csv-files-as-dataframes-using-pandas-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Import all the relevant csv files as dataframes using pandas</a></span><ul class="toc-item"><li><span><a href="#Dropping-repeats-from-each-individual-dataframe" data-toc-modified-id="Dropping-repeats-from-each-individual-dataframe-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Dropping repeats from each individual dataframe</a></span></li><li><span><a href="#Combining-all-the-dataframes-into-one" data-toc-modified-id="Combining-all-the-dataframes-into-one-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Combining all the dataframes into one</a></span></li></ul></li><li><span><a href="#Extracting-more-information-from-the-current-data" data-toc-modified-id="Extracting-more-information-from-the-current-data-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Extracting more information from the current data</a></span><ul class="toc-item"><li><span><a href="#Taking-just-the-salary" data-toc-modified-id="Taking-just-the-salary-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Taking just the salary</a></span><ul class="toc-item"><li><span><a href="#What-do-the-salaries-I-have-look-like?" data-toc-modified-id="What-do-the-salaries-I-have-look-like?-2.1.1"><span class="toc-item-num">2.1.1&nbsp;&nbsp;</span>What do the salaries I have look like?</a></span></li><li><span><a href="#Using-the-pay-rate-to-find-the-true-salaries" data-toc-modified-id="Using-the-pay-rate-to-find-the-true-salaries-2.1.2"><span class="toc-item-num">2.1.2&nbsp;&nbsp;</span>Using the pay rate to find the true salaries</a></span></li></ul></li><li><span><a href="#Looking-at-job-titles" data-toc-modified-id="Looking-at-job-titles-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Looking at job titles</a></span><ul class="toc-item"><li><span><a href="#What-are-the-titles-for-the-new-dataframe?" data-toc-modified-id="What-are-the-titles-for-the-new-dataframe?-2.2.1"><span class="toc-item-num">2.2.1&nbsp;&nbsp;</span>What are the titles for the new dataframe?</a></span></li></ul></li></ul></li><li><span><a href="#Data-frame-with-grouped-job-labels" data-toc-modified-id="Data-frame-with-grouped-job-labels-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Data frame with grouped job labels</a></span><ul class="toc-item"><li><span><a href="#Revisiting-the-salary" data-toc-modified-id="Revisiting-the-salary-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Revisiting the salary</a></span></li><li><span><a href="#Imputing-salaries-using-the-medians" data-toc-modified-id="Imputing-salaries-using-the-medians-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Imputing salaries using the medians</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Imputing-the-salaries-as-a-continuous-variable." data-toc-modified-id="Imputing-the-salaries-as-a-continuous-variable.-3.2.0.1"><span class="toc-item-num">3.2.0.1&nbsp;&nbsp;</span>Imputing the salaries as a continuous variable.</a></span></li></ul></li></ul></li></ul></li><li><span><a href="#Extracting-locations" data-toc-modified-id="Extracting-locations-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Extracting locations</a></span></li><li><span><a href="#Final-dataframe-removing-irrelevant-information" data-toc-modified-id="Final-dataframe-removing-irrelevant-information-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Final dataframe removing irrelevant information</a></span></li></ul></div>

In [1]:
import pandas as pd
import numpy as np
from sklearn.feature_extraction.text import CountVectorizer
import matplotlib as plt
%matplotlib inline
import re

## Import all the relevant csv files as dataframes using pandas

In [2]:
buissness_intelligence=pd.read_csv('./dataset/buisiness_intelligence_jobs.csv', sep='\t')
data_analyst=pd.read_csv('./dataset/data_analyst_jobs.csv',sep='\t')
data_science=pd.read_csv('./dataset/data_science.csv',sep='\t')
data_scientist=pd.read_csv('./dataset/data_scientist_jobs.csv',sep='\t')
insights_analyst=pd.read_csv('./dataset/insights_analysts_jobs.csv',sep='\t')
data_analyst_aus=pd.read_csv('./dataset/data_analyst_Aus.csv',sep='\t')
data_scientist_VIC=pd.read_csv('./dataset/data_scientist_VIC.csv',sep='\t')
data_analyst_VIC=pd.read_csv('./dataset/data_analyst_VIC.csv',sep='\t')
data_science_Aus=pd.read_csv('./dataset/data_science_Aus.csv',sep='\t')
complete_data_scientist=pd.read_csv('./dataset/complete_data_scientist.csv', sep='\t')
complete_data_analyst=pd.read_csv('./dataset/complete_data_analyst.csv', sep='\t')
complete_business_analyst=pd.read_csv('./dataset/complete_business_analyst.csv', sep='\t')

### Dropping repeats from each individual dataframe

I created a function that will take a dataframe as the input and drop any duplicates within the data frame and drop the irrelevant column that was originally the index for each job.

In [3]:
def drop_repeats(list_of_df):
    for df in list_of_df:
        df.drop('Unnamed: 0',axis=1,inplace=True)
        df.drop_duplicates(inplace=True)

I created a list with all my dataframes within to pass through the function and then apply the function

In [4]:
list_of_df=[buissness_intelligence,data_analyst,data_science,data_scientist,
            insights_analyst,data_analyst_aus,data_scientist_VIC,data_analyst_VIC,data_science_Aus,
           complete_data_scientist,complete_data_analyst,complete_business_analyst]

In [5]:
drop_repeats(list_of_df)

### Combining all the dataframes into one
Using panda's concat function I joined all the dataframes into one and ignored the index.

In [6]:
job_df=pd.concat(list_of_df,ignore_index=True)

In [7]:
#Checking the dimensions of the resulting dataframe as a reference before dropping more diplicates
job_df.shape

(6735, 4)

In [8]:
job_df.drop_duplicates(inplace=True)

The new resulting dataframe has 4 rows and 4644 columns

In [9]:
job_df.shape

(4644, 4)

## Extracting more information from the current data

### Taking just the salary
I have used regular expression to go through each entry in my 'salary' column and tanken out only the numbers which start with '__$__'

In [10]:
def split_it(entry):
    return re.findall('\$\d+(?:\,\d+)?(?:\s\d+)?', entry)

In [11]:
job_df['revised_salary'] = job_df['salary'].map(split_it)

In [12]:
job_df.revised_salary.head()

0    [$60,000, $85,000]
1            [$100,000]
2            [$155,000]
3                    []
4                    []
Name: revised_salary, dtype: object

Any where there was no salary I wanted to replace with __NAN__ this will allow me to do calculations on that column later on.

In [13]:
job_df.revised_salary = job_df.revised_salary.apply(lambda x: np.nan if len(x)==0 else x)

In [14]:
job_df.revised_salary.head()

0    [$60,000, $85,000]
1            [$100,000]
2            [$155,000]
3                   NaN
4                   NaN
Name: revised_salary, dtype: object

**There are 969 jobs with salaries in my dataframe **

In [15]:
#I used the number of rows in my overall dataframe and minused with the number of null values in the new column
job_df.shape[0]-job_df.revised_salary.isnull().sum()

969

This leaves me with a list of strings that have a salary but also contains other information such as '__$__' and '__,__'. To tackle this issue, I made a function to only return numbers in a string.

In [16]:
def clean(val):
    if type(val)!=float:
        i=re.sub('(\$)','', str(val))
        i=re.sub("(\')", "",i)
        i=re.sub("(\,)", "",i)
        i=re.sub("(\[)", "",i)
        i=re.sub("(\])", "",i)
        a= i.split(' ')
        numbers=[int(x) for x in a]
        return numbers

In [17]:
job_df.revised_salary=job_df.revised_salary.apply(clean)

In [18]:
job_df.revised_salary.head()

0    [60000, 85000]
1          [100000]
2          [155000]
3              None
4              None
Name: revised_salary, dtype: object

Where there is a salary range, I want instead just a single number, this is critical to allow me to do my regression analysis. I decided to use just teh average between the two ranges and take that as the expected salary for each job where applicable. Doing it in this way, even if there a is a single number estimation for the salary, it won't change.

In [19]:
job_df.revised_salary=job_df.revised_salary.fillna(0).apply(np.mean)

In [20]:
job_df.revised_salary.head()

0     72500.0
1    100000.0
2    155000.0
3         0.0
4         0.0
Name: revised_salary, dtype: float64

I will have to replace any '__0__' values again with __NAN__ to make further transformations possible.

In [21]:
job_df.revised_salary.replace({0:np.nan},inplace=True)

#### What do the salaries I have look like?
It seems there are salaries in different formats given by different employers.

A yearly salary can't possibly be less than $26, so what do they mean?

In [22]:
job_df[job_df.revised_salary<100].head()

,description,location,salary,title,revised_salary
89,The Company\r\n\r\nAre you currently in-betwee...,- Sydney NSW,"BI AdministratorRobert Half Australia6,884 rev...",BI Administrator,26.0
389,3 Month Contract\r\nDesktop Support\r\n$36.50 ...,- Sydney NSW,Desktop Support OfficerFinite IT - Sydney NSW$...,Desktop Support Officer,36.0
451,Seeking Financial Accountant to assist the Fin...,- Sydney NSW,Financial AccountantMorgan McKinley19 reviews ...,Financial Accountant,60.0
480,Heavy vehicle mechanic needed for Afternoon or...,- Arncliffe NSW,Heavy Vehicle Mechanic ( Afternoon or Bi weekl...,Heavy Vehicle Mechanic ( Afternoon or Bi weekl...,34.5
490,ASAP – 15/02/2018\r\nGladesville\r\n$62 per Ho...,- Sydney NSW,Marketing & Communications OfficerFinite IT - ...,Marketing & Communications Officer,62.0

It seems the employers can give either an hourly rate, day rate or yearly rate.

In [23]:
#Finding jobs where the salary is $26 and seeing what they really mean
print(job_df[job_df.revised_salary==26].iloc[0,2])
print(job_df[job_df.revised_salary<500].iloc[50,2])
print(job_df[job_df.revised_salary>80000].iloc[0,2])

BI AdministratorRobert Half Australia6,884 reviews - Sydney NSW$26 an hour
Payments and Cards Business AnalystPia Recruitment - Melbourne VIC$110 a day - Contract
Business Intelligence AnalystRobert Half Australia6,884 reviews - Sydney NSW$100,000 a year - Permanent

I will need to extract this pay rate information from the data available. I will be using regular expression to do this and putting the information into a new column.

In [24]:
def pay_rate(year):
    jobs=re.findall('(\.*?a day*?\w+)', year,re.IGNORECASE)
    jobs1=re.findall('(\.*?an hour*?\w+)', year,re.IGNORECASE)
    jobs2=re.findall('(\.*?a week*?\w+)', year,re.IGNORECASE)

    return (jobs,jobs1,jobs2)

In [25]:
job_df['pay_rate']=job_df.salary.apply(pay_rate)

In [26]:
#Here is an example of the outcome of my function
job_df.pay_rate.tail(20).head(1)

6709    ([a day], [], [])
Name: pay_rate, dtype: object

It isn't quite in the format that I need yet so I will need to go through and drop the extra empty list and just have a singluar value in the column where possible.

In [27]:
def just_one(lis):
    for entry in lis:
        for i in entry:
            if len(i)>2:
                return(i)
            else:
                return np.nan

In [28]:
job_df.pay_rate=job_df.pay_rate.apply(just_one)

In [29]:
#Here is the example from above after running the function
job_df.pay_rate.values[-20]

'a day'

#### Using the pay rate to find the true salaries

In [30]:
#If there is no value in pay rate for that row I will assume that they meant to have it as a yearly rate
#and so will replace null values with 1
job_df.pay_rate.fillna(1,inplace=True)

I then created a function to return a number depending on what the pay rate is. I calculated the number to return based on an average working year. The average person works an **8** hour day, **5** days a week, **49** weeks a year. This means for an hourly rate, I want to return **1960** which is the number of hours the average person will work in a year. for a day rate, I want to return **245** which is the number of days an average person will work in a year. If I had no pay rate, as I mentioned earlier, I will assume it is a yearly rate so I will return **1**.

In [31]:
def pay_multiply(rate):
    
    if rate =='an hour':
        a=1960
        return a
    if rate =='a day':
        a=245
        return a
    if rate =='a week':
        a=49
        return a
    if rate ==1:
        a=1
        return a

I will run this function and return the numbers into a new column and then apply the pay rate to the salaries to obtain the actual yearly salaries.

In [32]:
job_df['pay_multiplier']=job_df.pay_rate.apply(pay_multiply)

In [33]:
job_df.revised_salary=job_df.revised_salary*job_df.pay_multiplier

In [34]:
job_df[job_df.revised_salary < 3000].head()

,description,location,salary,title,revised_salary,pay_rate,pay_multiplier
1312,Employment Type: Permanent Full Time\r\nPositi...,- Royal North Shore Hospital NSW,Senior Analyst Cost Accounting (Clinical Costi...,Senior Analyst Cost Accounting (Clinical Costing),2275.5,1,1.0
1921,Our client is a large innovative organisation ...,- Sydney NSW,Solution Architect ($1200pd Contract)Bloc IT R...,Solution Architect ($1200pd Contract),1200.0,1,1.0
2362,Leverage your extensive Financial Modelling ex...,- North Shore NSW,FP&A Analyst $60ph + Super (3mth assignment)Re...,FP&A Analyst $60ph + Super (3mth assignment),60.0,1,1.0
5456,Our client is seeking an experienced Data Ware...,- Melbourne VIC,Data Warehouse Architect - Up to $140KTotal Re...,Data Warehouse Architect - Up to $140K,140.0,1,1.0
6237,This globally recognised Telco company is curr...,- Sydney NSW,Business Analyst | Telco | Product | $850 p/d ...,Business Analyst | Telco | Product | $850 p/d ...,850.0,1,1.0

Getting this result although it is not exactly what I am after, I will move on and instead focus on jsut keeping the jobs I am after before returning to cleaning up the data more.

In [35]:
# This entry shows me that although I can clean this more, the job title is irrelevant to what I am after
job_df[job_df.revised_salary < 3000].iloc[1,2]

'Solution Architect ($1200pd Contract)Bloc IT Recruitment - Sydney NSW'

### Looking at job titles
This job title column is quite messy and will require quite a bit of cleaning with regular expressions to make it usable. Thankfully there does seem to be a nice bulk of relevant job titles that I am after already.

In [36]:
job_df.title.value_counts().head()

Business Analyst              170
Data Scientist                 75
Data Analyst                   61
Senior Business Analyst        59
Technical Business Analyst     32
Name: title, dtype: int64

I am defining the functions that I will use to determine the job titles for each of the jobs. Basically, if they contain the specific words, I will return the title

In [37]:
def just_jobs_data(year):
    jobs=re.findall('(\.*?Data scientist*?\w+)', year,re.IGNORECASE)
    return (' '.join(jobs))

In [38]:
def just_jobs_analyst(year):
    jobs1=re.findall('(\.*?data analyst*?\w+)', year,re.IGNORECASE)
    return (' '.join(jobs1))

In [39]:
def just_jobs_business(year):
    jobs1=re.findall('(\.*?business analyst*?\w+)', year,re.IGNORECASE)
    return (' '.join(jobs1))

In [40]:
job_df['data_scientist']=job_df.title.map(just_jobs_data)

In [41]:
job_df['data_analyst']=job_df.title.map(just_jobs_analyst)

In [42]:
job_df['business_analyst']=job_df.title.map(just_jobs_business)

What I have now is a new row for each of the relevant titles and if they appear in the 'title' this is what they are called as.

In [43]:
job_df.head()

,description,location,salary,title,revised_salary,pay_rate,pay_multiplier,data_scientist,data_analyst,business_analyst
0,Job SummaryWe are seeking to fill an extremely...,- Sydney NSW,Team Assistant with AI companyHIVERY - Sydney ...,Team Assistant with AI company,72500.0,1,1.0,,,
1,The Company\r\n\r\nAre you fascinated by the s...,- Sydney NSW,Business Intelligence AnalystRobert Half Austr...,Business Intelligence Analyst,100000.0,1,1.0,,,
2,Senior Business Intelligence Consultant (Archi...,- Sydney NSW,Senior Business Intelligence ConsultantRobert ...,Senior Business Intelligence Consultant,155000.0,1,1.0,,,
3,"Prospa, Australia's #1 online lender to small ...",- Sydney NSW,Business Intelligence AnalystProspa - Sydney NSW,Business Intelligence Analyst,NaN,1,1.0,,,
4,What’s your ambition? Is it a big goal or smal...,- Sydney NSW,"Business Intelligence Reporting AnalystJLL1,87...",Business Intelligence Reporting Analyst,NaN,1,1.0,,,

Anywhere where there are no entries, I have replae them with NaN

In [44]:
job_df.data_scientist=job_df.data_scientist.apply(lambda x: np.nan if len(x)==0 else x)

In [45]:
job_df.data_analyst=job_df.data_analyst.apply(lambda x: np.nan if len(x)==0 else x)

In [46]:
job_df.business_analyst=job_df.business_analyst.apply(lambda x: np.nan if len(x)==0 else x)

Using the three new columns, I can combine them all together to get specific roles that the jobs are advertising for

In [47]:
job_df['rel_title']=job_df.data_scientist.astype(str)+job_df.data_analyst.astype(str)+job_df.business_analyst.astype(str)

With this information now stored in a new column, any job which has 'nannannan' in the 'rel_title' column means they are not jobs in which I am interested in.

In [48]:
df=job_df[job_df.rel_title != 'nannannan']

#### What are the titles for the new dataframe?
Although it is a lot more cleaned, there is still quite a bit of noise that I need to filter.

In [49]:
df.rel_title.value_counts()

nannanBusiness Analyst                     853
nanData Analystnan                         215
Data Scientistnannan                       183
nannanbusiness analyst                      16
nandata analystnan                           7
nannanBusiness Analysts                      7
nanData Analystsnan                          5
nannanBUSINESS ANALYST                       5
nanDATA ANALYSTnan                           4
data scientistnannan                         4
Data Scientist Data Scientistnannan          3
nannanBusiness analyst                       3
Data ScientistData Analystnan                2
nannanBusiness Analyst Business Analyst      2
nannanBUSINESS ANALYST_CALYPSO               2
Data Scientistsnannan                        1
nanData AnalystBusiness Analyst              1
Data scientistnannan                         1
nannanBusiness Analysis                      1
Name: rel_title, dtype: int64

**This is not the prettiest way to do it but I basically went through and created a dictionary to replace the titles to make them consistent**

In [50]:
df.rel_title=df.rel_title.replace({'nannanBusiness Analyst':'Business Analyst','nanData Analystnan':'Data Analyst',
                      'Data Scientistnannan':'Data Scientist','nanData Analystsnan':'Data Analyst',
                      'nannanBusiness Analysts':'Business Analyst','nandata analystnan':'Data Analyst',
                     'data scientistnannan':'Data Scientist','Data Scientist Data Scientistnannan':'Data Scientist',
                     'nanDATA ANALYSTnan':'Data Analyst','nannanbusiness analyst':'Business Analyst',
                     'Data ScientistData Analystnan':'Data Analyst','Data scientistnannan':'Data Scientist',
                     'nannanBUSINESS ANALYST':'Business Analyst','Data Scientistsnannan':'Data Scientist',
                      'nanData AnalystBusiness Analyst':'Data Analyst','nannanBusiness analyst':'Business Analyst',
                     'nannanBusiness Analyst Business Analyst':'Business Analyst','nannanBUSINESS ANALYST_CALYPSO':'Business Analyst',
                                  'nannanBusiness Analysis':'Business Analyst'})

C:\Users\Jennifer\Anaconda3\lib\site-packages\pandas\core\generic.py:4401: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self[name] = value

**The resultant dataframe not has 3 consistent job categories that make sense.**

In [51]:
df.rel_title.value_counts()

Business Analyst    889
Data Analyst        234
Data Scientist      192
Name: rel_title, dtype: int64

## Data frame with grouped job labels

I used a strategy similar to above where I cleaned the salaries to instead go through and clean the seniority level for the jobs. For this I decided to filter on senior, junior and graduate.

In [52]:
grouped_df=df.loc[:,['description','location','salary','title','revised_salary','rel_title']]

In [53]:
#Pulls out the ranks associated with each job ad
def ranking(year):
    jobs=re.findall('(\.*?senior*?\w+)', year,re.IGNORECASE)
    jobs1=re.findall('(\.*?junior*?\w+)', year,re.IGNORECASE)
    jobs2=re.findall('(\.*?graduate*?\w+)', year,re.IGNORECASE)
    return (jobs,jobs1,jobs2)

In [54]:
grouped_df['ranking']=grouped_df.title.map(ranking)

In [55]:
#Removes the empty lists that result
def just_rank(ranks):
    for entry in ranks:
        for i in entry:
            if len(i)>2:
                return(i)
            else:
                return np.nan

In [56]:
grouped_df.ranking=grouped_df.ranking.map(just_rank)

**Anywhere there was no Seniority level, I instead used the label 'Normal"**

In [57]:
grouped_df.ranking.fillna('Normal',inplace=True)

In [58]:
# Are the ranks consistent?
grouped_df.ranking.value_counts()

Normal      1024
Senior       245
Junior        28
senior         8
Graduate       7
SENIOR         2
junior         1
Name: ranking, dtype: int64

Since the ranks I created were not consistent, I replaced them with the appropriate values. 

I also decided to look at graduate roles as junior roles

In [59]:
grouped_df.ranking=grouped_df.ranking.replace({'senior':'Senior','Graduate':'Junior','SENIOR':'Senior','junior':'Junior'})

In [60]:
grouped_df.ranking.value_counts()

Normal    1024
Senior     255
Junior      36
Name: ranking, dtype: int64

**Using all this newly created information, I made a new column which encapsulates all that information and splits my dataset into 9 distinct groups**

In [61]:
grouped_df['category']=grouped_df.rel_title+grouped_df.ranking

In [62]:
grouped_df.category.value_counts()

Business AnalystNormal    680
Data AnalystNormal        201
Business AnalystSenior    188
Data ScientistNormal      143
Data ScientistSenior       39
Data AnalystSenior         28
Business AnalystJunior     21
Data ScientistJunior       10
Data AnalystJunior          5
Name: category, dtype: int64

### Revisiting the salary
Now that I have cleaned up my jobs to have only the relevant job titles, I will now recheck the salaries to determine which ones need correcting. I do make an assumption here though that anything less than $20,000 a year will need to be revised as that is what I believe the bare minimum to be.

In [63]:
grouped_df[grouped_df.revised_salary<25000]

,description,location,salary,title,revised_salary,rel_title,ranking,category
3418,The Role\r\n\r\nThis is a 3 month contract wit...,- Brisbane QLD,"Business AnalystRobert Half Australia6,883 rev...",Business Analyst,19600.0,Business Analyst,Normal,Business AnalystNormal
6237,This globally recognised Telco company is curr...,- Sydney NSW,Business Analyst | Telco | Product | $850 p/d ...,Business Analyst | Telco | Product | $850 p/d ...,850.0,Business Analyst,Normal,Business AnalystNormal
6395,Opportunity for an experienced BA to play a ke...,- Melbourne VIC,Snr Business Analyst - Consumer RetailPia Recr...,Snr Business Analyst - Consumer Retail,22050.0,Business Analyst,Normal,Business AnalystNormal
6555,Senior Business Analyst contract opportunity a...,- Sydney Central Business District NSW,senior business analyst - digital / agile - $8...,senior business analyst - digital / agile - $8...,850.0,Business Analyst,Senior,Business AnalystSenior
6565,Senior Business Analyst opportunity at a top t...,- Sydney Central Business District NSW,senior business analyst - trade surveillance -...,senior business analyst - trade surveillance -...,925.0,Business Analyst,Senior,Business AnalystSenior
6591,Senior Business Analyst contract opportunity a...,- Sydney Central Business District NSW,senior business analyst - ops risk & controls ...,senior business analyst - ops risk & controls ...,850.0,Business Analyst,Senior,Business AnalystSenior
6621,Lead Business Analyst long-term contract oppor...,- Sydney Central Business District NSW,lead business analyst - financial services - $...,lead business analyst - financial services - $...,900.0,Business Analyst,Normal,Business AnalystNormal

In [64]:
# There are several salaries that are below $1000, it seems my previous regular expression was not able to pick them up
grouped_df[grouped_df.revised_salary<25000].iloc[6,2]

'lead business analyst - financial services - $900 to 1000/dayRandstad11,835 reviews - Sydney Central Business District NSWContract'

I used a slightly different approach to solving the problem this time, I again created a new column with the pay rate and gave them all values of 1 to start. Since all the jobs that have the wrong salary are all still as __day rate__, I can simple impute __245__ into the pay rate where the salary is less than $1,000.

In [65]:
grouped_df['pay_rate']=1

In [66]:
grouped_df.loc[(grouped_df.revised_salary < 1000),'pay_rate'] = 245

I then simply used the pay rate to once again calculate the yearly salary

In [67]:
grouped_df.revised_salary=grouped_df.revised_salary*grouped_df.pay_rate

In [68]:
#Dropping the pay rate column as that is no longer needed
grouped_df.drop('pay_rate',axis=1,inplace=True)

In [69]:
#checking now that the data for salaries matches my assumption of above $20,000
grouped_df[grouped_df.revised_salary<20000]

,description,location,salary,title,revised_salary,rel_title,ranking,category
3418,The Role\r\n\r\nThis is a 3 month contract wit...,- Brisbane QLD,"Business AnalystRobert Half Australia6,883 rev...",Business Analyst,19600.0,Business Analyst,Normal,Business AnalystNormal

I decided to plot the salaries that I have to help me decide what to do moving on.

In [70]:
grouped_df.groupby(['category']).count()

,description,location,salary,title,revised_salary,rel_title,ranking
category,,,,,,,
Business AnalystJunior,21,21,21,21,5,21,21
Business AnalystNormal,680,680,680,680,145,680,680
Business AnalystSenior,188,188,188,188,35,188,188
Data AnalystJunior,5,5,5,5,2,5,5
Data AnalystNormal,201,201,201,201,37,201,201
Data AnalystSenior,28,28,28,28,8,28,28
Data ScientistJunior,10,10,10,10,2,10,10
Data ScientistNormal,143,143,143,143,36,143,143
Data ScientistSenior,39,39,39,39,11,39,39

Although some of the categories are quite sparse, I will be using the medians of each of the categories to impute into jobs where no salary exists. This is definitely not the perfect solution but because I intend to tackle question 1 as a regression problem this is the best solution moving forward.

In [71]:
median_salary=grouped_df.groupby(['category']).median()

In [72]:
median_salary.revised_salary.sort_values()

category
Data AnalystJunior         73220.0
Business AnalystJunior     80000.0
Data AnalystNormal         85000.0
Data ScientistJunior       85000.0
Business AnalystNormal    105000.0
Data AnalystSenior        125000.0
Data ScientistNormal      125000.0
Data ScientistSenior      135000.0
Business AnalystSenior    145000.0
Name: revised_salary, dtype: float64

I also want to have a salary range in case I intend to use to answer question 1 as a classification.

I chose some arbitary levels for the salaries based for the calculated median salary values. I chose these because they made sense to me but normally, it is in this situation where you would need to consult the __domain expert__ to determine what levels are appropriate.

In [73]:
median_salary['salary_level']=0

In [74]:
median_salary.loc[(median_salary.revised_salary <86000 ),'salary_level'] = 'low'
median_salary.loc[(median_salary.revised_salary >86000) &(median_salary.revised_salary <126000),'salary_level'] = 'med'
median_salary.loc[(median_salary.revised_salary >126000 ),'salary_level'] = 'high'

In [75]:
median_salary

                        revised_salary salary_level
category
Business AnalystJunior         80000.0          low
Business AnalystNormal        105000.0          med
Business AnalystSenior        145000.0         high
Data AnalystJunior             73220.0          low
Data AnalystNormal             85000.0          low
Data AnalystSenior            125000.0          med
Data ScientistJunior           85000.0          low
Data ScientistNormal          125000.0          med
Data ScientistSenior          135000.0         high

### Imputing salaries using the medians

To continue on with the next part of the cleaning, I will have to replace any null values with 'none' so that there will be something I can use to call later on. I also created a new column to add in the salary classes that I worked out as well.

In [76]:
grouped_df.revised_salary.fillna('none',inplace=True)

In [77]:
grouped_df['salary_level']=0

##### Imputing the salaries as a continuous variable.

In [78]:
#For each job category, if the salary is non existent, 
#take the median salary for that category and replace the null value with it
for i in grouped_df.category.unique():
    grouped_df.loc[(grouped_df.category == i)&(grouped_df.revised_salary =='none'),
                   'revised_salary'] = median_salary.loc[i,'revised_salary']

###### Imputing the salaries as a class

In [79]:
#For each job category impute the salary level based on the job title and the ranges I set earlier
for i in grouped_df.category.unique():
    grouped_df.loc[(grouped_df.category == i),
                   'salary_level'] = median_salary.loc[i,'salary_level']

In [80]:
grouped_df.head()

,description,location,salary,title,revised_salary,rel_title,ranking,category,salary_level
17,Digital Sales Business Analyst\r\nOpportunity ...,- Sydney NSW,Digital Business AnalystQantas Airways Limited...,Digital Business Analyst,105000,Business Analyst,Normal,Business AnalystNormal,med
21,About the role : As a Business Analyst you wou...,- Sydney NSW,Business AnalystProject Professional Services ...,Business Analyst,102500,Business Analyst,Normal,Business AnalystNormal,med
32,TNT Express is one of the world's leading prov...,- Mascot NSW,"Business AnalystTNT Express2,136 reviews - Mas...",Business Analyst,105000,Business Analyst,Normal,Business AnalystNormal,med
34,For over 15 years Quantium have combined the b...,- Sydney NSW,Agile Business AnalystQuantium13 reviews - Syd...,Agile Business Analyst,105000,Business Analyst,Normal,Business AnalystNormal,med
36,A vacancy exists in the above unit for a highl...,- Darlinghurst NSW,Business AnalystSt Vincent's Health Network - ...,Business Analyst,105000,Business Analyst,Normal,Business AnalystNormal,med

## Extracting locations

I will now extract the locations from the information provided. I will be extracting down to the suburb level where possible.

In [81]:
#Using regular expression, if the location contains specific key words, I want to give it a specific value,
# if it contains 'NSW', I want the value to be 'NSW'. The reason why some have the case specified is because some of the
#entries are not in the same format
grouped_df.loc[grouped_df.location.str.contains('(\.*?NSW*?\w+)'),'state']='NSW'
grouped_df.loc[grouped_df.location.str.contains('(\.*?VIC*?\w+)',case=False),'state']='VIC'
grouped_df.loc[grouped_df.location.str.contains('(\.*?QLD*?\w+)'),'state']='QLD'
grouped_df.loc[grouped_df.location.str.contains('(\.*?SA)'),'state']='SA'
grouped_df.loc[grouped_df.location.str.contains('(\.*?NT)'),'state']='NT'
grouped_df.loc[grouped_df.location.str.contains('(\.*?ACT*?\w+)'),'state']='ACT'
grouped_df.loc[grouped_df.location.str.contains('(\.*?WA*?\w+)'),'state']='WA'

#After going through the list, any rows which don't have a value I can assume were missed by my regular expression,
#I went through and made sure to catch these with different regular expression
##For the locations which are simply listed as AUS, I assumed they were for NSW simply because that is where most
##of the jobs are
grouped_df.loc[grouped_df.location.str.contains('(\.*?aus*?\w+)',case=False),'state']='NSW'
grouped_df.loc[grouped_df.location.str.contains('(\.*?que*?\w+)',case=False),'state']='QLD'

C:\Users\Jennifer\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.
  after removing the cwd from sys.path.
C:\Users\Jennifer\Anaconda3\lib\site-packages\ipykernel_launcher.py:5: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.
  """
C:\Users\Jennifer\Anaconda3\lib\site-packages\ipykernel_launcher.py:6: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.

C:\Users\Jennifer\Anaconda3\lib\site-packages\ipykernel_launcher.py:7: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.
  import sys
C:\Users\Jennifer\Anaconda3\lib\site-packages\ipykernel_launcher.py:8: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.

C:\Users\Jennifer\Anaconda3\lib\site-packages\ipykernel_launcher.py:9: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.
  if __name__ == '__main__':
C:\Users\Jennifer\Anaconda3\lib\site-packages\ipykernel_launcher.py:10: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.
  # Remove the CWD from sys.path while we load stuff.
C:\Users\Jennifer\Anaconda3\lib\site-packages\ipykernel_launcher.py:16: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.
  app.launch_new_instance()
C:\Users\Jennifer\Anaconda3\lib\site-packages\ipykernel_launcher.py:17: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.

In [82]:
grouped_df['city']=grouped_df.location.str.replace('(\.*?NSW*?\w+)','').str.replace('(\.*?VIC*?\w+)','',
case=False).str.replace('(\.*?QLD*?\w+)','').str.replace('(\.*?SA)','').str.replace('(\.*?NT)','').str.replace('(\.*?ACT*?\w+)'
,'').str.replace('(\.*?WA*?\w+)','').str.replace('(\.*?aus*?\w+)','',case=False).str.replace('(\.*?queensland*?\w+)',''
,case=False).str.replace('-','')

## Final dataframe removing irrelevant information
For the next steps of modelling, I will need to just the relevant columns that I have created. I will drop the collumns that are no longer needed.

In [83]:
imputed_salaries=grouped_df.drop(['location','salary'], axis=1)

In [84]:
imputed_salaries.head()

,description,title,revised_salary,rel_title,ranking,category,salary_level,state,city
17,Digital Sales Business Analyst\r\nOpportunity ...,Digital Business Analyst,105000,Business Analyst,Normal,Business AnalystNormal,med,NSW,Sydney
21,About the role : As a Business Analyst you wou...,Business Analyst,102500,Business Analyst,Normal,Business AnalystNormal,med,NSW,Sydney
32,TNT Express is one of the world's leading prov...,Business Analyst,105000,Business Analyst,Normal,Business AnalystNormal,med,NSW,Mascot
34,For over 15 years Quantium have combined the b...,Agile Business Analyst,105000,Business Analyst,Normal,Business AnalystNormal,med,NSW,Sydney
36,A vacancy exists in the above unit for a highl...,Business Analyst,105000,Business Analyst,Normal,Business AnalystNormal,med,NSW,Darlinghurst

In [85]:
#Removing any spaces that were reminants from how the cities were created using regex
imputed_salaries.city=imputed_salaries.city.apply(lambda x:"".join(x.split()))